src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_СоглашенияОПоставке/Forms/ФормаПодбораПродуктов/Module.bsl
&НаКлиенте
Процедура ВыбратьИЗакрыть(Команда)
	//rarus vikhle 27.09.2021 mt 18286 +++
	Если ПодобранныеПродукты.Количество() > 0 И НестандартныеУсловияОплаты Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, Нстр("ru = 'В текущей заявке нестандартные условия оплаты, при добавлении продуктов они будут перезаполнены на стандартные, продолжить?'"),
						РежимДиалогаВопрос.ДаНет);
		Возврат;
	Иначе	
		//rarus vikhle 27.09.2021 mt 18286 ---	
		Закрыть(ПоместитьТаблицуРезультатаВХранилище(ВладелецФормы.УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопроса(ОтветПользователя, ДопПараметры) Экспорт //rarus vikhle 27.09.2021 mt 18286 
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		Закрыть(ПоместитьТаблицуРезультатаВХранилище(ВладелецФормы.УникальныйИдентификатор));	
	КонецЕсли;	
	
КонецПроцедуры //rarus vikhle 27.09.2021 mt 18286 ---	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОчиститьСообщения(); //rarus vikhle 13.05.2021 mt 17733
	СтандартнаяОбработка = ложь;
	ПараметрПоиск = Новый Структура("Продукт", элементы.Список.ТекущиеДанные.продукт);	
	МассивСтрок = ПодобранныеПродукты.НайтиСтроки(ПараметрПоиск);
	Если МассивСтрок.Количество() = 0 Тогда
		//rarus vikhle 13.05.2021 mt 17733 +++
		ТекущиеДанные =  Элементы.Список.ТекущиеДанные;
		
		Если БУ Тогда
			Если НЕ СтавкаНДСЗаявки.Пустая() И СтавкаНДСЗаявки <> ТекущиеДанные.СтоимостьПродажиБУСтавкаНДС Тогда
				ВывестиСообщениеПол(Нстр("ru = 'У продукта с номером шасси <%1> ставка НДС <%2> отличается от ставки НДС <%3> заявки. Продукт нельзя подобрать.'"),,,,,
									ТекущиеДанные.НомерПродукта,
									Строка(ТекущиеДанные.ЗначениеСтавкиНДС) + "%",
									СтавкаНДСЗаявки);
				Возврат;	
			КонецЕсли;	
			
			Если НЕ ПодобранныеПродукты.Количество() = 0 Тогда
				СтруктураОтбора = Новый Структура("СтоимостьПродажиБУСтавкаНДС",ТекущиеДанные.СтоимостьПродажиБУСтавкаНДС);
				МассивСтрок = ПодобранныеПродукты.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество() <> ПодобранныеПродукты.Количество() Тогда
					ВывестиСообщениеПол(Нстр("ru = 'В таблице подобранных продуктов продукты со ставкой НДС <%1>, у продукта с номером шасси <%2> ставка НДС <%3>. Продукт нельзя подобрать.'"),,,,,
										Строка(ПодобранныеПродукты[0].ЗначениеСтавкиНДС) + "%",
										ТекущиеДанные.НомерПродукта,
										Строка(ТекущиеДанные.ЗначениеСтавкиНДС) + "%");
					Возврат;
				КонецЕсли; 
			КонецЕсли;	
			
		КонецЕсли;	
		//rarus vikhle 13.05.2021 mt 17733 ---
		
		//rarus vikhle 07.12.2021 m 18643 +++
		СтруктураОтбора = Новый Структура("ТипСпецификации", ТекущиеДанные.ТипСпецификации);
		МассивСтрок = ПодобранныеПродукты.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() <> ПодобранныеПродукты.Количество() Тогда
			ВывестиСообщениеПол(Нстр("ru = 'В таблице подобранных продуктов продукты с типом спецификации <%1>, у продукта с номером шасси <%2> тип спецификации <%3>. Продукт нельзя подобрать.'"),,,,,
									Строка(ПодобранныеПродукты[0].ТипСпецификации),
									ТекущиеДанные.НомерПродукта,
									Строка(ТекущиеДанные.ТипСпецификации));
				Возврат;	
		КонецЕсли;
		//rarus vikhle 07.12.2021 m 18643 ---
		
		//rarus vikhle 22.09.2021 mt 18298 +++
		Если ПроверятьСовпадениеСтандартнойСпецификации Тогда
			СтруктураОтбора = Новый Структура("СтандартнаяСпецификация",ТекущиеДанные.СтандартнаяСпецификация);
			МассивСтрок = ПодобранныеПродукты.НайтиСтроки(СтруктураОтбора);	
			Если МассивСтрок.Количество() <> ПодобранныеПродукты.Количество() Тогда
				ВывестиСообщениеПол(Нстр("ru = 'В таблице подобранных продуктов продукты с стандартной спецификацией <%1>, у продукта с номером шасси <%2> стандартная спецификация <%3>. Продукт нельзя подобрать.'"),,,,,
									Строка(ПодобранныеПродукты[0].СтандартнаяСпецификация),
									ТекущиеДанные.НомерПродукта,
									Строка(ТекущиеДанные.СтандартнаяСпецификация));
				Возврат;	
			КонецЕсли;	
		КонецЕсли;	
		//rarus vikhle 22.09.2021 mt 18298 ---
		
		НоваяСтрока = ПодобранныеПродукты.Добавить();
		//rarus vikhle 17.12.2020 mt 16977 +++
		НоваяСтрока.Продукт             = ТекущиеДанные.Продукт;
		НоваяСтрока.DD 					= ТекущиеДанные.DD;
		НоваяСтрока.DD2					= ТекущиеДанные.DD2;
		НоваяСтрока.ДатаПродажиДилеру	= ТекущиеДанные.ДатаПродажиДилеру;
		//rarus vikhle 17.12.2020 mt 16977 ---	
		НоваяСтрока.ДатаПродажиКлиенту  = ТекущиеДанные.ДатаПродажиКлиенту;//rarus vikhle 10.03.2021 mt 17324
		//rarus vikhle 13.05.2021 mt 17733 +++
		НоваяСтрока.СтоимостьПродажиБУ			= ТекущиеДанные.СтоимостьПродажиБУ;
		НоваяСтрока.СтоимостьПродажиБУСтавкаНДС = ТекущиеДанные.СтоимостьПродажиБУСтавкаНДС;
		НоваяСтрока.ЗначениеСтавкиНДС			= ТекущиеДанные.ЗначениеСтавкиНДС;
		//rarus vikhle 13.05.2021 mt 17733 ---
		НоваяСтрока.ТипСпецификации				= ТекущиеДанные.ТипСпецификации; //rarus vikhle 07.12.2021 m 18643 
		НоваяСтрока.СтандартнаяСпецификация		= ТекущиеДанные.СтандартнаяСпецификация; //rarus vikhle 22.09.2021 mt 18298
	Иначе
		ВывестиСообщениеПол("Продукт уже добавлен");
	КонецЕсли;

	//ПоместитьВПодобранные(ВыбраннаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПоместитьВПодобранные(ВыбраннаяСтрока)
	
	Поиск = Новый Структура("Продукт", ВыбраннаяСтрока);	
	МассивСтрок = ПодобранныеПродукты.НайтиСтроки(Поиск);	
	Если МассивСтрок.Количество() = 0 Тогда
		НоваяСтрока = ПодобранныеПродукты.Добавить();
		НоваяСтрока.Продукт = ВыбраннаяСтрока.Продукт;
	Иначе
		ВывестиСообщениеПол("Продукт уже добавлен");
	КонецЕсли;

	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
КонецПроцедуры
 
// Поместить таблицу результата в хранилище
//
// Параметры:
//  ИдентификаторВладельца - УникальныйИдентификатор - Уникальный идентификатор формы владельца
// 
// Возвращаемое значение:
//  Строка - Адрес временного хранилища
//
&НаСервере
Функция ПоместитьТаблицуРезультатаВХранилище(ИдентификаторВладельца)
	
	Возврат ПоместитьВоВременноеХранилище(ПодобранныеПродукты.Выгрузить(), ИдентификаторВладельца);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Модель") Тогда
		//rarus vikhle 14.10.2020 mt 16181 +++
		Если Параметры.Свойство("ОтборПоЧастичномуСовпадениюМодели") Тогда
			ОсноваИмениМодели = Лев(СокрЛП(Параметры.Модель.Наименование),10); 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Модель.Наименование", ОсноваИмениМодели,ВидСравненияКомпоновкиДанных.НачинаетсяС,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);	
			//rarus vikhle 14.10.2020 mt 16181 ---	
		Иначе	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Модель", Параметры.Модель,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
		КонецЕсли;	
	КонецЕсли;
	
	//rarus vikhle 14.02.2023 m 19839 +++
	Если Параметры.Свойство("Марки") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Марка", Параметры.Марки, ВидСравненияКомпоновкиДанных.ВСписке,,,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;	
	//rarus vikhle 14.02.2023 m 19839 ---
	
	//rarus ozhnik 15888  31.08.2020 + 
	Если Параметры.Свойство("ПустоеСоглашениеОПоставке") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СоглашениеОПоставке", Справочники.Scan_СоглашенияОПоставке.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	КонецЕсли;
	
	//rarus vikhle 13.08.2020 mt 16181 +++
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Изделие.ЛокальныйСтатусПродукта",Справочники.Scan_ЛокальныеСтатусыПродуктов.OPEN,ВидСравненияКомпоновкиДанных.Равно,	,	,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный ,);
	//rarus vikhle 13.08.2020 mt 16181 ---	
	
	//rarus agar 28.08.2020 15696 ++
	МассивТиповПродуктовНадстроекИУслуг = Справочники.Scan_ТипыПродуктов.ПолучитьТипыПродуктовНадстроекИУслуг();
	Список.Параметры.УстановитьЗначениеПараметра("МассивТиповПродуктовНадстроекИУслуг", МассивТиповПродуктовНадстроекИУслуг);
	//rarus agar 28.08.2020 15696 --
	
	//rarus vikhle 23.11.2020 mt 16181 +++
	Если Параметры.Свойство("ТипСпецификации") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ТипСпецификации", Параметры.ТипСпецификации, ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
	КонецЕсли;
	
	Если Параметры.Свойство("НомерСпецификации") Тогда
		//rarus agar 07.04.2021 17394 ++
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ТипСпецификации", Параметры.НомерСпецификации, ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
		
		//rarus vikhle 29.12.2021 m 18269 +++
		//СпецификацияСтандартнойМодели = Документы.Scan_СпецификацияСтандартнойМодели.НайтиПоРеквизиту("НомерСпецификации", Параметры.НомерСпецификации);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Scan_СпецификацияСтандартнойМодели.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.Scan_СпецификацияСтандартнойМодели КАК Scan_СпецификацияСтандартнойМодели
		               |ГДЕ
		               |	Scan_СпецификацияСтандартнойМодели.НомерСпецификации = &НомерСпецификации";
		Запрос.УстановитьПараметр("НомерСпецификации", Параметры.НомерСпецификации);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		МассивСпецификаций = Новый Массив;
		Пока Выборка.Следующий() Цикл
			МассивСпецификаций.Добавить(Выборка.Ссылка);
		КонецЦикла;	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СтандартнаяСпецификация", МассивСпецификаций, ВидСравненияКомпоновкиДанных.ВСписке,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"СтандартнаяСпецификация", СпецификацияСтандартнойМодели, ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
		//rarus vikhle 29.12.2021 m 18269 ---
		//rarus agar 07.04.2021 17394 --
	КонецЕсли;

	
	//rarus vikhle 23.11.2020 mt 16181 ---
	
	//rarus agar 03.02.2021 17123 ++
	Если Параметры.Свойство("БУ") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"ПродуктБУ", Параметры.БУ, ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);
		
		//rarus vikhle 13.05.2021 mt 17733 +++
		БУ = Параметры.БУ;
		//В заявке / обработке есть Б/У продукты, добавить можно только БУ продукты с ставкой НДС = ставке НДС заявки / обработки
		Если Параметры.Свойство("СтавкаНДС") Тогда 
			СтавкаНДСЗаявки = Параметры.СтавкаНДС;	
		КонецЕсли;	
		//rarus vikhle 13.05.2021 mt 17733 ---
	КонецЕсли;
	//rarus agar 03.02.2021 17123 --
	
	//rarus vikhle 22.09.2021 mt 18298 +++
	Если Параметры.Свойство("ПроверятьСовпадениеСтандартнойСпецификации") Тогда
		ПроверятьСовпадениеСтандартнойСпецификации = Параметры.ПроверятьСовпадениеСтандартнойСпецификации;
	КонецЕсли;	
	//rarus vikhle 22.09.2021 mt 18298 ---
	
	//rarus vikhle 22.07.2021 mt 17834 +++
	//Если Параметры.Свойство("Марка") Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Марка", Параметры.Марка, ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,);	
	//КонецЕсли;	
	//rarus vikhle 22.07.2021 mt 17834 ---
	
	НестандартныеУсловияОплаты = Параметры.Свойство("НестандартныеУсловияОплаты");//rarus vikhle 27.09.2021 m 18286
	
	ОтображениеФиксированногоОтбора(); //rarus vikhle 24.08.2021 mt 17834
	
КонецПроцедуры

&НаСервере
Процедура ОтображениеФиксированногоОтбора() //rarus vikhle 24.08.2021 mt 17834 +++
	
	ПредставлениеОбъекта = Метаданные.Справочники.Scan_СоглашенияОПоставке.ПредставлениеОбъекта;
	ПредставлениеОтбора  = Scan_ВспомогательныеФункцииСервер.ПолучитьПредставлениеОтбораФормыВыбора(ЭтотОбъект, ПредставлениеОбъекта);
	
	Если Не ПустаяСтрока(ПредставлениеОтбора) Тогда
		ФиксированныйОтборПредставление = ПредставлениеОтбора;
		
		Элементы.ФиксированныйОтборПредставление.Видимость = Истина;
		Элементы.ФиксированныйОтборПредставление.Высота    = СтрЧислоСтрок(ПредставлениеОтбора);
	КонецЕсли;
	
КонецПроцедуры //rarus vikhle 24.08.2021 mt 17834 ---
